Repository: leodigi92/woocommerce-nhanhvn-v3
Catalog: languages/nhanhvn-*.po
Languages: vi_vn

source: Nhanh.vn Sync
vi_vn: Đồng bộ Nhanh.vn

source: Settings saved.
vi_vn: Cài đặt đã được lưu.

source: Sync Status
vi_vn: Trạng thái đồng bộ

source: Type
vi_vn: Loại

source: Item ID
vi_vn: ID mục

source: Status
vi_vn: Trạng thái

source: Message
vi_vn: Thông báo

source: Time
vi_vn: Thời gian

source: Save Settings
vi_vn: Lưu cài đặt

source: Nhanh.vn Shipping
vi_vn: Vận chuyển Nhanh.vn

source: Title
vi_vn: Tiêu đề

source: Nhanh.vn Integration requires WooCommerce to be installed and active.
vi_vn: Tích hợp Nhanh.vn yêu cầu WooCommerce được cài đặt và kích hoạt.

source: Manual Sync
vi_vn: Đồng bộ thủ công

source: Sync Type
vi_vn: Loại đồng bộ

source: Products
vi_vn: Sản phẩm

source: Orders
vi_vn: Đơn hàng

source: Sync Now
vi_vn: Đồng bộ ngay

source: Product sync queued.
vi_vn: Đồng bộ sản phẩm đã được xếp hàng.

source: Order sync queued.
vi_vn: Đồng bộ đơn hàng đã được xếp hàng.

source: Enable GHN Shipping
vi_vn: Kích hoạt Giao Hàng Nhanh (GHN)

source: Enable GHTK Shipping
vi_vn: Kích hoạt Giao Hàng Tiết Kiệm (GHTK)

source: GHN Shipping
vi_vn: Vận chuyển GHN

source: GHTK Shipping
vi_vn: Vận chuyển GHTK

source: Settings
vi_vn: Cài đặt

source: Reports
vi_vn: Báo cáo

source: Help
vi_vn: Hỗ trợ

source: Sync Reports
vi_vn: Báo cáo đồng bộ

source: Successful
vi_vn: Thành công

source: Failed
vi_vn: Thất bại

source: Customers
vi_vn: Khách hàng

source: Help & Documentation
vi_vn: Hỗ trợ & Tài liệu

source: Welcome to Nhanh.vn Integration plugin. This plugin helps you sync products, orders, customers, inventory, and shipping with Nhanh.vn.
vi_vn: Chào mừng bạn đến với plugin Tích hợp Nhanh.vn. Plugin này giúp bạn đồng bộ sản phẩm, đơn hàng, khách hàng, tồn kho và vận chuyển với Nhanh.vn.

source: Getting Started
vi_vn: Bắt đầu

source: Obtain your Nhanh.vn API credentials from your Nhanh.vn account.
vi_vn: Lấy thông tin xác thực API Nhanh.vn từ tài khoản Nhanh.vn của bạn.

source: Go to WooCommerce > Nhanh.vn Sync > General Settings and enter your App ID, Secret Key, and retrieve an Access Token.
vi_vn: Vào WooCommerce > Đồng bộ Nhanh.vn > Cài đặt chung và nhập App ID, Secret Key, sau đó lấy Access Token.

source: Enable desired shipping methods (GHN, GHTK) if needed.
vi_vn: Kích hoạt các phương thức vận chuyển mong muốn (GHN, GHTK) nếu cần.

source: Use the Products or Inventory tabs to sync data manually.
vi_vn: Sử dụng tab Sản phẩm hoặc Kho hàng để đồng bộ dữ liệu thủ công.

source: Check the Logs tab to monitor sync progress.
vi_vn: Kiểm tra tab Nhật ký để theo dõi tiến độ đồng bộ.

source: Troubleshooting
vi_vn: Khắc phục sự cố

source: If sync fails, check the Logs tab for error messages.
vi_vn: Nếu đồng bộ thất bại, kiểm tra tab Nhật ký để xem thông báo lỗi.

source: Ensure your App ID, Secret Key, and Access Token are correct.
vi_vn: Đảm bảo App ID, Secret Key và Access Token của bạn đúng.

source: Verify that your server allows outgoing HTTP requests to Nhanh.vn API.
vi_vn: Xác minh rằng server của bạn cho phép các yêu cầu HTTP gửi đến API Nhanh.vn.

source: Check WooCommerce logs (WooCommerce > Status > Logs) for detailed errors.
vi_vn: Kiểm tra nhật ký WooCommerce (WooCommerce > Trạng thái > Nhật ký) để xem lỗi chi tiết.

source: Support
vi_vn: Hỗ trợ

source: For further assistance, contact the developer at:
vi_vn: Để được hỗ trợ thêm, liên hệ với nhà phát triển tại:

source: Nhanh.vn Integration requires Composer dependencies. Please run `composer install` in the plugin directory.
vi_vn: Tích hợp Nhanh.vn yêu cầu các phụ thuộc Composer. Vui lòng chạy `composer install` trong thư mục plugin.

source: Webhook Management
vi_vn: Quản lý Webhook

source: Click the button below to register the webhook with Nhanh.vn.
vi_vn: Nhấn nút bên dưới để đăng ký webhook với Nhanh.vn.

source: Register Webhook
vi_vn: Đăng ký Webhook

source: Webhook registered successfully.
vi_vn: Webhook đã được đăng ký thành công.

source: Failed to register webhook:
vi_vn: Không thể đăng ký webhook:

source: General Settings
vi_vn: Cài đặt chung

source: Product Sync
vi_vn: Đồng bộ sản phẩm

source: Sync All Products
vi_vn: Đồng bộ tất cả sản phẩm

source: Sync Selected Products
vi_vn: Đồng bộ sản phẩm được chọn

source: Selected products synced.
vi_vn: Sản phẩm được chọn đã được đồng bộ.

source: All products synced.
vi_vn: Tất cả sản phẩm đã được đồng bộ.

source: Product ID
vi_vn: ID sản phẩm

source: Name
vi_vn: Tên

source: Price
vi_vn: Giá

source: Stock
vi_vn: Tồn kho

source: No products found.
vi_vn: Không tìm thấy sản phẩm.

source: Inventory Sync
vi_vn: Đồng bộ kho hàng

source: Sync All Inventory
vi_vn: Đồng bộ tất cả kho hàng

source: Sync Selected Inventory
vi_vn: Đồng bộ kho hàng được chọn

source: Selected inventory synced.
vi_vn: Kho hàng được chọn đã được đồng bộ.

source: All inventory synced.
vi_vn: Tất cả kho hàng đã được đồng bộ.

source: Shipping Settings
vi_vn: Cài đặt vận chuyển

source: Current Configuration
vi_vn: Cấu hình hiện tại

source: Yes
vi_vn: Có

source: No
vi_vn: Không

source: Test Shipping Fee
vi_vn: Kiểm tra phí vận chuyển

source: Carrier
vi_vn: Đơn vị vận chuyển

source: City
vi_vn: Thành phố

source: Address
vi_vn: Địa chỉ

source: Weight (kg)
vi_vn: Trọng lượng (kg)

source: Shipping fee: %s
vi_vn: Phí vận chuyển: %s

source: Failed to calculate shipping fee:
vi_vn: Không thể tính phí vận chuyển:

source: Webhook Status
vi_vn: Trạng thái Webhook

source: Unregister Webhook
vi_vn: Hủy đăng ký Webhook

source: Webhook unregistered successfully.
vi_vn: Webhook đã được hủy đăng ký thành công.

source: Failed to unregister webhook:
vi_vn: Không thể hủy đăng ký webhook:

source: No webhook logs found.
vi_vn: Không tìm thấy nhật ký webhook.

source: Sync Logs
vi_vn: Nhật ký đồng bộ

source: All Types
vi_vn: Tất cả loại

source: Order Sync
vi_vn: Đồng bộ đơn hàng

source: All Statuses
vi_vn: Tất cả trạng thái

source: Success
vi_vn: Thành công

source: Error
vi_vn: Lỗi

source: Filter
vi_vn: Lọc

source: No logs found.
vi_vn: Không tìm thấy nhật ký.

source: App ID
vi_vn: ID ứng dụng

source: Enter your Nhanh.vn App ID.
vi_vn: Nhập ID ứng dụng Nhanh.vn của bạn.

source: Secret Key
vi_vn: Khóa bí mật

source: Enter your Nhanh.vn Secret Key.
vi_vn: Nhập Khóa bí mật Nhanh.vn của bạn.

source: Access Token
vi_vn: Token truy cập

source: Click to retrieve an access token from Nhanh.vn.
vi_vn: Nhấn để lấy token truy cập từ Nhanh.vn.

source: Get Access Token
vi_vn: Lấy Access Token

source: Access token retrieved successfully.
vi_vn: Token truy cập đã được lấy thành công.

source: Failed to retrieve access token:
vi_vn: Không thể lấy token truy cập:

source: Redirect URL
vi_vn: URL chuyển hướng

source: Copy this URL and add it to your Nhanh.vn application settings.
vi_vn: Sao chép URL này và thêm vào cài đặt ứng dụng Nhanh.vn của bạn.

source: Copy
vi_vn: Sao chép

source: Are you sure you want to sync?
vi_vn: Bạn có chắc chắn muốn đồng bộ không?

source: Copy successful!
vi_vn: Sao chép thành công!

source: Failed to copy.
vi_vn: Sao chép thất bại.
